<?php
namespace Pondol\Fortune\Services;

class Sipsin
{

  private static $sipsin = [
    'h' => [
      '甲'=> ['甲'=>'비견', '乙'=>'겁재', '丙'=>'식신', '丁'=>'상관', '戊'=>'편재', '己'=>'정재', '庚'=>'편관', '辛'=>'정관', '壬'=>'편인', '癸'=>'정인'],
      '乙'=> ['乙'=>'비견', '甲'=>'겁재', '丁'=>'식신', '丙'=>'상관', '己'=>'편재', '戊'=>'정재', '辛'=>'편관', '庚'=>'정관', '癸'=>'편인', '壬'=>'정인'],
      '丙'=> ['丙'=>'비견', '丁'=>'겁재', '戊'=>'식신', '己'=>'상관', '庚'=>'편재', '辛'=>'정재', '壬'=>'편관', '癸'=>'정관', '甲'=>'편인', '乙'=>'정인'],
      '丁'=> ['丁'=>'비견', '丙'=>'겁재', '己'=>'식신', '戊'=>'상관', '辛'=>'편재', '庚'=>'정재', '癸'=>'편관', '壬'=>'정관', '乙'=>'편인', '甲'=>'정인'],
      '戊'=> ['戊'=>'비견', '己'=>'겁재', '庚'=>'식신', '辛'=>'상관', '壬'=>'편재', '癸'=>'정재', '甲'=>'편관', '乙'=>'정관', '丙'=>'편인', '丁'=>'정인'],
      '己'=> ['己'=>'비견', '戊'=>'겁재', '辛'=>'식신', '庚'=>'상관', '癸'=>'편재', '壬'=>'정재', '乙'=>'편관', '甲'=>'정관', '丁'=>'편인', '丙'=>'정인'],
      '庚'=> ['庚'=>'비견', '辛'=>'겁재', '壬'=>'식신', '癸'=>'상관', '甲'=>'편재', '乙'=>'정재', '丙'=>'편관', '丁'=>'정관', '戊'=>'편인', '己'=>'정인'],
      '辛'=> ['辛'=>'비견', '庚'=>'겁재', '癸'=>'식신', '壬'=>'상관', '乙'=>'편재', '甲'=>'정재', '丁'=>'편관', '丙'=>'정관', '己'=>'편인', '戊'=>'정인'],
      '壬'=> ['壬'=>'비견', '癸'=>'겁재', '甲'=>'식신', '乙'=>'상관', '丙'=>'편재', '丁'=>'정재', '戊'=>'편관', '己'=>'정관', '庚'=>'편인', '辛'=>'정인'],
      '癸'=> ['癸'=>'비견', '壬'=>'겁재', '乙'=>'식신', '甲'=>'상관', '丁'=>'편재', '丙'=>'정재', '己'=>'편관', '戊'=>'정관', '辛'=>'편인', '庚'=>'정인']
    ], 
    'e' => [
      '甲'=> ['寅'=>'비견', '卯'=>'겁재', '巳'=>'식신', '午'=>'상관', '辰'=>'편재', '戌'=>'편재', '丑'=>'정재', '未'=>'정재', '申'=>'편관', '酉'=>'정관', '亥'=>'편인', '子'=>'정인'],
      '乙'=> ['卯'=>'비견', '寅'=>'겁재', '午'=>'식신', '巳'=>'상관', '丑'=>'편재', '未'=>'편재', '辰'=>'정재', '戌'=>'정재', '酉'=>'편관', '申'=>'정관', '子'=>'편인', '亥'=>'정인'],
      '丙'=> ['巳'=>'비견', '午'=>'겁재', '辰'=>'식신', '戌'=>'식신', '丑'=>'상관', '未'=>'상관', '申'=>'편재', '酉'=>'정재', '亥'=>'편관', '子'=>'정관', '寅'=>'편인', '卯'=>'정인'],
      '丁'=> ['午'=>'비견', '巳'=>'겁재', '丑'=>'식신', '未'=>'식신', '辰'=>'상관', '戌'=>'상관', '酉'=>'편재', '申'=>'정재', '子'=>'편관', '亥'=>'정관', '卯'=>'편인', '寅'=>'정인'],
      '戊'=> ['辰'=>'비견', '戌'=>'비견', '丑'=>'겁재', '未'=>'겁재', '申'=>'식신', '酉'=>'상관', '亥'=>'편재', '子'=>'정재', '寅'=>'편관', '卯'=>'정관', '巳'=>'편인', '午'=>'정인'],
      '己'=> ['丑'=>'비견', '未'=>'비견', '辰'=>'겁재', '戌'=>'겁재', '酉'=>'식신', '申'=>'상관', '子'=>'편재', '亥'=>'정재', '卯'=>'편관', '寅'=>'정관', '午'=>'편인', '巳'=>'정인'],
      '庚'=> ['申'=>'비견', '酉'=>'겁재', '亥'=>'식신', '子'=>'상관', '寅'=>'편재', '卯'=>'정재', '巳'=>'편관', '午'=>'정관', '辰'=>'편인', '戌'=>'편인', '丑'=>'정인', '未'=>'정인'],
      '辛'=> ['酉'=>'비견', '申'=>'겁재', '子'=>'식신', '亥'=>'상관', '卯'=>'편재', '寅'=>'정재', '午'=>'편관', '巳'=>'정관', '丑'=>'편인', '未'=>'편인', '辰'=>'정인', '戌'=>'정인'],
      '壬'=> ['亥'=>'비견', '子'=>'겁재', '寅'=>'식신', '卯'=>'상관', '巳'=>'편재', '午'=>'정재', '辰'=>'편관', '戌'=>'편관', '丑'=>'정관', '未'=>'정관', '申'=>'편인', '酉'=>'정인'],
      '癸'=> ['子'=>'비견', '亥'=>'겁재', '卯'=>'식신', '寅'=>'상관', '午'=>'편재', '巳'=>'정재', '丑'=>'편관', '未'=>'편관', '辰'=>'정관', '戌'=>'정관', '酉'=>'편인', '申'=>'정인']
    ]
  ];

  public function withSaju($saju) {
    $this->hour = (object)[
      'h' => $this->cal($saju->get_h('day'), $saju->get_h('hour'), 'h'),
      'e' => $this->cal($saju->get_h('day'), $saju->get_e('hour'), 'e')
    ];
    $this->day = (object)[
      'h' => '일원',
      'e' => $this->cal($saju->get_h('day'), $saju->get_e('day'), 'e')
    ];
    $this->month = (object)[
      'h' => $this->cal($saju->get_h('day'), $saju->get_h('month'), 'h'),
      'e' => $this->cal($saju->get_h('day'), $saju->get_e('month'), 'e')
    ];
    $this->year = (object)[
      'h' => $this->cal($saju->get_h('day'), $saju->get_h('year'), 'h'),
      'e' => $this->cal($saju->get_h('day'), $saju->get_e('year'), 'e')
    ];
    return $this;
  }

  /**
  *@param string $day_h : 출생일의 일간
  *@param string $he : 천간 혹은 지지
  *@param string $flag : h: 천간  e: 지지
  */
  static function cal($day_h, $he, $flag) {
    return self::$sipsin[$flag][$day_h][$he];
  }
}
