<?php

  // 십간(十干) 데이타
  define('GAN', [
    'ko'=>['갑', '을', '병', '정', '무', '기', '경', '신', '임', '계'],
    'ch'=>['甲', '乙', '丙', '丁', '戊', '己', '庚', '辛', '壬', '癸']
  ]);

  /**
   * 십이지(十二支) 데이타
   * @var array 
   */
  define('JI', [
    'ko'=>['자', '축', '인', '묘', '진', '사', '오', '미', '신', '유', '술', '해'],
    'ch'=>['子', '丑', '寅', '卯', '辰', '巳', '午', '未', '申', '酉', '戌', '亥']
  // month  11,   12,    1,    2,    3,    4     5     6,    7,   8,   9,   10
  ]);

    /**
   * 60간지 데이터
   * @var array 
   */
  define('GANJI', [
    'ko' => [
      '갑자', '을축', '병인', '정묘', '무진', '기사', '경오', '신미', '임신', '계유', '갑술', '을해',
      '병자', '정축', '무인', '기묘', '경진', '신사', '임오', '계미', '갑신', '을유', '병술', '정해', 
      '무자', '기축', '경인', '신묘', '임진', '계사', '갑오', '을미', '병신', '정유', '무술', '기해', 
      '경자', '신축', '임인', '계묘', '갑진', '을사', '병오', '정미', '무신', '기유', '경술', '신해',
      '임자', '계축', '갑인', '을묘', '병진', '정사', '무오', '기미', '경신', '신유', '임술', '계해'
    ],
    'ch' => [
      '甲子','乙丑','丙寅','丁卯','戊辰','己巳','庚午','辛未','壬申','癸酉','甲戌','乙亥',
      '丙子','丁丑','戊寅','己卯','庚辰','辛巳','壬午','癸未','甲申','乙酉','丙戌','丁亥',
      '戊子','己丑','庚寅','辛卯','壬辰','癸巳','甲午','乙未','丙申','丁酉','戊戌','己亥',
      '庚子','辛丑','壬寅','癸卯','甲辰','乙巳','丙午','丁未','戊申','己酉','庚戌','辛亥',
      '壬子','癸丑','甲寅','乙卯','丙辰','丁巳','戊午','己未','庚申','辛酉','壬戌','癸亥'
    ]
  ]);

  define('ZODIAC', [
    'ko' => ['쥐', '소', '범', '토끼', '용', '뱀', '말', '양', '원숭이', '닭', '개', '돼지'],
    'en' => ['rat', 'ox', 'tiger', 'rabbit', 'dragon', 'snake', 'horse', 'sheep', 'monkey', 'rooster', 'dog', 'pig']
  ]);

      /**
   * 절기 데이터
   * @var array 
   */
  define('SEASON24', [
    'ko'=>[
      '입춘', '우수', '경칩', '춘분', '청명', '곡우','입하', '소만', '망종', '하지', '소서', '대서',
      '입추', '처서', '백로', '추분', '한로', '상강', '입동', '소설', '대설', '동지', '소한', '대한'
    ],
    'ch' => [
      '立春', '雨水', '驚蟄', '春分', '淸明', '穀雨', '立夏', '小滿', '芒種', '夏至', '小暑', '大暑',
      '立秋', '處暑', '白露', '秋分', '寒露', '霜降', '立冬', '小雪', '大雪', '冬至', '小寒', '大寒']
  ]);

/**
   * 28일 데이터
   * @var array ($s28days)
   */
  define('SU28', [
  'ch'=> [
    '角','亢','氐','房','心','尾','箕',
    '斗','牛','女','虛','危','室','壁',
    '奎','婁','胃','昴','畢','觜','參',
    '井','鬼','柳','星','張','翼','軫'
  ],
  'ko' => [
    '각', '항', '저', '방', '심', '미', '기',
    '두', '우', '녀', '허', '위', '실', '벽',
    '규', '수', '위', '묘', '필', '자', '삼',
    '정', '귀', '류', '성', '장', '익', '진'
  ]
  ]);

  /**
   * 요일 데이터
   * @var array 
   */
  define('WEEK', [
    'ko' => ['일','월','화','수','목','금','토'],
    'ch' => ['日','月','火','水','木','金','土']
  ]);

  /*
  입춘부터 경칩까지	寅月(인월)
  경칩부터 청명까지	卯月(묘월)
  청명부터 입하까지	辰月(진월)
  입하부터 망종까지	巳月(사월)
  망종부터 소서까지	午月(오월)
  소서부터 입추까지	未月(미월)
  입추부터 백로까지	申月(신월)
  백로부터 한로까지	酉月(유월)
  한로부터 입동까지	戌月(술월)
  입동부터 대설까지	亥月(해월)
  대설부터 소한까지	子月(자월)
  소한부터 입춘까지	丑月(축월)
*/