<?php


    // 'sixty' => [
    //     '甲子','乙丑','丙寅','丁卯','戊辰','己巳','庚午','辛未','壬申','癸酉',
    //     '甲戌','乙亥','丙子','丁丑','戊寅','己卯','庚辰','辛巳','壬午','癸未',
    //     '甲申','乙酉','丙戌','丁亥','戊子','己丑','庚寅','辛卯','壬辰','癸巳',
    //     '甲午','乙未','丙申','丁酉','戊戌','己亥','庚子','辛丑','壬寅','癸卯',
    //     '甲辰','乙巳','丙午','丁未','戊申','己酉','庚戌','辛亥','壬子','癸丑',
    //     '甲寅','乙卯','丙辰','丁巳','戊午','己未','庚申','辛酉','壬戌','癸亥',
    // ],
    // $gigi = ['子','丑','寅','卯','辰','巳','午','未','申','酉','戌','亥'];

    // 십간(十干) 데이타
    $gan = [
      'ko'=>['갑', '을', '병', '정', '무', '기', '경', '신', '임', '계'],
      'ch'=>['甲', '乙', '丙', '丁', '戊', '己', '庚', '辛', '壬', '癸']
    ];

    /**
     * 십이지(十二支) 데이타
     * @var array 
     */
    $ji = [
      'ko'=>['자', '축', '인', '묘', '진', '사', '오', '미', '신', '유', '술', '해'],
      'ch'=>['子', '丑', '寅', '卯', '辰', '巳', '午', '未', '申', '酉', '戌', '亥']
    ];


    $zodiac = [
      'ko' => ['쥐', '소', '범', '토끼', '용', '뱀', '말', '양', '원숭이', '닭', '개', '돼지'],
      'en' => ['rat', 'ox', 'tiger', 'rabbit', 'dragon', 'snake', 'horse', 'sheep', 'monkey', 'rooster', 'dog', 'pig']
    ];

    // 'sigi_baeyeul' =>['자','축','인','묘','진','사','오','미','신','유','술','해'], // ,'야자'
    // 'chungan'=>['甲','乙','丙','丁','戊','己','庚','辛','壬','癸'],

//     'gabja' =>[
//         [
//             '甲子','乙丑','丙寅','丁卯','戊辰','己巳','庚午','辛未','壬申','癸酉',
//             '甲戌','乙亥','丙子','丁丑','戊寅','己卯','庚辰','辛巳','壬午','癸未',
//             '甲申','乙酉','丙戌','丁亥','戊子','己丑','庚寅','辛卯','壬辰','癸巳',
//             '甲午','乙未','丙申','丁酉','戊戌','己亥','庚子','辛丑','壬寅','癸卯',
//             '甲辰','乙巳','丙午','丁未','戊申','己酉','庚戌','辛亥','壬子','癸丑',
//             '甲寅','乙卯','丙辰','丁巳','戊午','己未','庚申','辛酉','壬戌','癸亥'
//         ],[
//             '甲子','甲戌','甲申','甲午','甲辰','甲寅','乙丑','乙亥','乙酉','乙未',
//             '乙巳','乙卯','丙寅','丙子','丙戌','丙申','丙午','丙辰','丁卯','丁丑',
//             '丁亥','丁酉','丁未','丁巳','戊辰','戊寅','戊子','戊戌','戊申','戊午',
//             '己巳','己卯','己丑','己亥','己酉','己未','庚午','庚辰','庚寅','庚子',
//             '庚戌','庚申','辛未','辛巳','辛卯','辛丑','辛亥','辛酉','壬申','壬午',
//             '壬辰','壬寅','壬子','壬戌','癸酉','癸未','癸巳','癸卯','癸丑','癸亥'
//         ]
//     ],
//     'sin5' =>['용신','희신','기신','구신','한신'],
//     'oheng'=>[
//         'chungan'=>['양목', '음목', '양화', '음화', '양토', '음토', '양금', '음금', '양수', '음수'],
//         'gigi'=>['양수', '음토', '양목', '음목', '양토', '음화', '양화', '음토', '양금', '음금', '양토', '음수']
//     ],
//     'unsung12' => ['장생', '목욕', '관대', '건록', '제왕', '쇠', '병', '사', '묘', '절', '태', '양'],
//     'sal12' => ['지살', '도화', '월살', '망신', '장성', '반안', '역마', '육해', '화개','겁살', '재살', '천살'],


// ];